{"config": {"layers": [{"config": {"batch_input_shape": [null, 7720], "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "units": 100, "activation": "relu", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_7", "use_bias": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "units": 100, "activation": "linear", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_8", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "units": 20, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_9", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_5"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}