{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Embedding", "config": {"output_dim": 100, "dtype": "float32", "mask_zero": false, "input_length": 6, "embeddings_regularizer": null, "trainable": true, "input_dim": 7720, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "batch_input_shape": [null, 6], "name": "embedding_1", "embeddings_constraint": null, "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"units": 128, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "stateful": false, "implementation": 1, "return_sequences": false, "use_bias": true, "unit_forget_bias": true, "name": "lstm_1", "activation": "tanh", "kernel_regularizer": null, "return_state": false, "go_backwards": false, "trainable": true, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "bias_constraint": null, "bias_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dense", "config": {"units": 7721, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activation": "softmax", "activity_regularizer": null}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}