{"config": {"layers": [{"config": {"trainable": true, "mask_zero": false, "batch_input_shape": [null, 6], "embeddings_constraint": null, "activity_regularizer": null, "input_length": 6, "output_dim": 100, "embeddings_regularizer": null, "name": "embedding_1", "dtype": "float32", "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "input_dim": 7720}, "class_name": "Embedding"}, {"config": {"return_state": false, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "trainable": true, "units": 128, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "name": "cu_dnnlstm_1", "recurrent_constraint": null, "stateful": false, "unit_forget_bias": true, "return_sequences": false, "go_backwards": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "CuDNNLSTM"}, {"config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true, "units": 7721, "activation": "softmax", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_10", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_6"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}